// Group 6 classworks - 

// 1) Js Functions 

// პირველი დავალენა ------------- საბაზისო ფუნქცია:
// შექმენით ფუნქცია, რომელიც მომხმარებელს მიესალმება შემდეგნაირად = 'გამარჯობა (სახელი), წარმატებულ დღეს გისურვებ'

function mfn() {
  c = (prompt('Tell us your Name'))
  alert(`გამარჯობა ${c} წარმატებულ დღეს გისურვებ`)
}
mfn()
// მეორე დავალება --------

// შექმენით ფუნქცია, რომელიც გამოითვლის მართკუთხედის ფართობს.
function hmwrk2(){
    a = 20;
    b = 10;
    alert('იცით მართკუთხედის ფართობი როგორ მივიღოთ?')
    alert('არა?')
    alert('s=a*b')
    alert(`იგივეა რაც: 20(a)* 10(b) ანუ = ${a*b}`)
}
hmwrk2()
// მესამე დავალება--------


// 2) DOM 


// პირველი დავალება ---

// DOM - ის დახმარებით შეცვალეთ ტექსტის შიგთავსი.

document.getElementById("huh").style.color = 'brown';

// მეორე დავალება ---

// DOM - ის დახმარებით შეცვალეთ ტექსტის სტილი.
document.getElementById("huh").style.fontSize = '90px';

// მესამე დავალება --- 

// შექმენით ღილაკი და ღილაკზე დაჭერის შედეგად ეკრანზე გამოისახოს  alert() სადაც გადაეცემა თქვენს მიერ არჩეული ტექსტი
click.onclick = function(){
    alert('Why are you click')

 }
//  3) Prompt

// პირველი დავალება --- 
// მომხმარებელმა უნდა შემოიტანოს რიცხვი 1 - დან 1000 - მდე, თქვენი მიზანია, რომ გამოიცნოთ შემოტანილი რიცხვი, 
// თუ სწორი იქნება დაპრინტეთ 'სწორია!', ხოლო თუ არასწორია, დაპრინტეთ ;არასწორია!'

let n = Number(prompt('მე ჩავიფიქრე რიცხვი 1 - დან 1000 მდე აბა გამოიცანი რომელია)'))
if(n<1) {
    alert('სწორია!')
}

else{
    alert('არასწორია!')
}

// მეორე დავალება ---

// დაწერეთ ფუნქცია, რომელიც მოუწოდებს მომხმარებელს შეიყვანოს ნივთების რაოდენობა, რომლის შეძენაც სურს.
// დარწმუნდით, რომ მომხმარებელმა შეიყვანს დადებითი რიცხვი მთლიანი ერთეულებისთვის.
// თითოეული ნივთისთვის, შესთავაზეთ მომხმარებელს შეიყვანოს ფასი.
// დარწმუნდით, რომ მომხმარებელმა შეიყვანოს დადებითი ნომერი თითოეული პროდუქტის ფასისთვის.
// გამოთვალეთ და აჩვენეთ ყველა ელემენტის მთლიანი ღირებულება.
// 
function fnct2() {
    let saxeli = prompt('თქვენი სახელი?')
    alert(`გამარჯობა ${saxeli}`)
    prompt(`შეხედე ${saxeli} ახლა მითხარი შენ ნივთებს რა ეღირება რა გთხოვ!`)
    let skamifasi = Number(prompt('ეს სკამი რა ღირს?'))
    alert(`თანახმა ვარ ვიყიდო ეს სკამი ${skamifasi} ლარად`)
    let wrwlfs = Number(prompt('ჭურჭელი რა ღირს?'))
    alert(`თანახმა ვარ ვიყიდო ეს ჭურჭელი ${wrwlfs} ლარად`)
    alert(`რამდენი მაგ გადასახადი?`)
    alert(`${saxeli}: ${skamifasi + wrwlfs} ლარი!`)
}
fnct2()
// 4) შედარებითი ოპერატორები

// გააკეთეთ 10 მაგალითი შედარებით ოპერატორებზე.
let age = Number (prompt(`you want buy alchohol? tell my your age!`))
if (age < 18) alert("Too young to buy alcohol");
else alert(`get it`)

let age2= Number (prompt(`you want buy Sigarete tell my your age!`))
if (age2 < 18) alert("Too young to buy alcohol");
else alert(`get it`)

let apple = Number (prompt('რამდენი ვაშლი დააგროვე დღეს?'))
if (apple > 10) alert("ყოჩაღ")
else alert(`ცოტაა!`)

let mark = Number (prompt('რა ნიშანი მიიღე დღეს?'))
if (mark>8) alert(`ყოჩაღ!`)
else alert(`ცუდია`)

let mark2 = Number (prompt('რა გაქ წლიური ნიშანი?'))
if (mark2>8) alert(`ყოჩაღ!`)
else alert(`ცუდია`)

let css = Number (prompt('რამდენად იცი ცსს 0დან 10მდე?'))
if (css>8) alert(`ყოჩაღ! არ ვიცოდი თუ ცსს ამდენად იცოდი`)
else alert(`ცუდია, გოაში შემოდი და გასწავლიან ადვილად!`)

let goa = Number(prompt(`შეაფასე გოა 0-დან 10მდე`))
if (goa>10) alert('ჩადი ხარ ')
else alert('გცემო გინდა?')
// 5) ლოგიკური ოპერატორები


// პირველი დავალება ---
// დაწერეთ JavaScript ფუნქცია, რათა შეამოწმოთ, 
// აქვს თუ არა მომხმარებელს ფასდაკლების უფლება 
// მისი ასაკისა და შესყიდვის მთლიანი თანხის მიხედვით.
// შესთავაზეთ მომხმარებელს შეიყვანოს მათი ასაკი და შესყიდვის მთლიანი თანხა.
//  დარწმუნდით, რომ მომხმარებელმა შეიყვანს დადებითი რიცხვები ასაკისა და შესყიდვის თანხისთვის.
//   გამოიყენეთ შემდეგი ფასდაკლების წესები: 60 წელზე უფროსი ასაკის მომხმარებლებს შეუძლიათ ისარგებლონ ფასდაკლებით.
// კლიენტებს, რომლებიც ხარჯავენ $100 ან მეტს,
//  შეუძლიათ მიიღონ ფასდაკლება. 60 წელზე უფროსი ასაკის მომხმარებლები და 100 დოლარი ან მეტი დახარჯული აქვთ უფრო მაღალი ფასდაკლების უფლება.
//   მომხმარებლისთვის აჩვენეთ შეტყობინება, რომელშიც მითითებულია, შეუძლიათ თუ არა მას ფასდაკლება და ფასდაკლების ოდენობა, თუ ეს შესაძლებელია.

// ?


// მეორე დავალება ---

// დაწერეთ JavaScript ფუნქცია, რათა შეამოწმოთ,
// არის თუ არა სტუდენტი უფლებამოსილი სტიპენდიის მისაღებად მათი აკადემიური მოსწრებისა და ოჯახის შემოსავლის მიხედვით.
// სთხოვეთ მომხმარებელს შეიყვანოს თავისი GPA (საშუალო ქულა) და ოჯახის შემოსავალი.
// დარწმუნდით, რომ მომხმარებელმა შეიყვანოს დადებითი ნომრები GPA და ოჯახის შემოსავლისთვის. გამოიყენეთ შემდეგი დასაშვებობის კრიტერიუმები:
//  სტუდენტები GPA 3.
// 5 ან მეტი ადამიანი უფლებამოსილია სტიპენდიის მისაღებად. სტუდენტები,
//  რომლებსაც აქვთ GPA 3.0 ან მეტი და ოჯახის შემოსავალი $50,000-ზე ნაკლები,
//   შეუძლიათ მიიღონ უმაღლესი სტიპენდია. სტუდენტები, რომლებსაც აქვთ GPA 3.0-ზე დაბალი, არ შეუძლიათ სტიპენდიის მიღება.
//    მომხმარებლისთვის აჩვენეთ შეტყობინება, რომელშიც მითითებულია, რამდენად შეუძლიათ სტიპენდიის მიღება და სტიპენდიის ოდენობა,
//     თუ ეს შესაძლებელია.
// ?

// 6) მონაცემთა ტიპები


// შემოიტანეთ სხვადასხვა ცვლადები, რომლებსაც ექნებათ სხვადასხვა მონაცემთა ტიპი, შემდგომ შეამოწმეთ ეს ტიპები.
let cvladi1 = John
typeof John
// 7) პირობითი განცხადებები


// პირველი დავალება --- 

// ჩაწერეთ JavaScript ფუნქცია,
//  რათა შეამოწმოთ სტუდენტმა ჩააბარა თუ ჩააბარა კურსი მათი გამოცდის ქულების მიხედვით.
//   სთხოვეთ მომხმარებელს შეიყვანოს ქულები შუალედური გამოცდისთვის,
//    დასკვნითი გამოცდისთვის და პროექტისთვის.
//     დარწმუნდით, რომ მომხმარებელმა შეიყვანოს სწორი ქულები (პოზიტიური რიცხვები 0-დან 100-მდე) თითოეული კომპონენტისთვის.
//  გამოიყენეთ შემდეგი შეფასების კრიტერიუმები:
//  თუ საშუალო ქულა (შეწონილი 20% შუალედური კურსისთვის, 40% საბოლოო და 40% პროექტისთვის) არის 70 ან მეტი,
//   სტუდენტი გაივლის კურსს. თუ საშუალო ქულა 70-ზე დაბალია, სტუდენტი ვერ ახერხებს კურსს. აჩვენეთ მომხმარებლისთვის შეტყობინება,
//    რომელშიც მითითებულია მისი გავლის/ჩავარდნის სტატუსი და გამოთვლილი საშუალო ქულა.
// ?
// მეორე დავალება --- 

// დაწერეთ JavaScript ფუნქცია იმის დასადგენად, აქვს თუ არა ადამიანს მართვის მოწმობის უფლება მისი ასაკისა და მართვის გამოცდილებიდან გამომდინარე.
//  შესთავაზეთ მომხმარებელს,
//  შეიყვანოს თავისი ასაკი და წლების რაოდენობა, რომელსაც მართავდა. დარწმუნდით,
//   რომ მომხმარებელმა შეიყვანოს სწორი მონაცემები (დადებითი მთელი რიცხვები ასაკისა და მართვის გამოცდილებისთვის).
// გამოიყენეთ შემდეგი საკვალიფიკაციო კრიტერიუმები: პირი უნდა იყოს მინიმუმ 18 წლის მართვის მოწმობის მისაღებად.
//  თუ პირი 18 წლამდეა, მას არ ექვემდებარება ლიცენზია. თუ პირი არის 18 წლის ან მეტი, მას უნდა ჰქონდეს მინიმუმ 1 წლიანი მართვის გამოცდილება,
//   რომ დაშვებული იყოს.
// მომხმარებლისთვის აჩვენეთ შეტყობინება,
//  რომელშიც მითითებულია მართვის მოწმობის მიღების უფლება.
function mowmoba(){
    let numprav = prompt('რამდენი წლის ხარ მართის მოწმობას რო ითხოვ ჰა? ', );
    if (numprav < 13) {
       alert('ბავშვი ხარ ძმა რა მოწმობა')
    }
    else if (numprav < 19){
       alert('შენ ხარ მოზარდი შემიძლია მოგცე ')
    }
    else {
        alert('სრულწლოვანი ხარ, ძმა გეთქვა მერე მაშინვე მოგცმედი')
   }
}
// მესამე დავალება --- 


// დაწერეთ JavaScript ფუნქცია, რათა დადგინდეს,
//  შეუძლია თუ არა პირს გასაუბრებაზე მისი კვალიფიკაციისა და გამოცდილების საფუძველზე.
//   შესთავაზეთ მომხმარებელს შეიყვანოს მათი განათლების დონე (მაგ., "უმაღლესი სკოლა", "კოლეჯი", "უნივერსიტეტი") და შესაბამისი სამუშაო გამოცდილების
//  წლების რაოდენობა.
// დარწმუნდით, რომ მომხმარებელმა შეიყვანს სწორი მონაცემები განათლების დონისა და გამოცდილების შესახებ (დადებითი მთელი რიცხვები გამოცდილებისთვის).
//  გამოიყენეთ შემდეგი საკვალიფიკაციო
//   კრიტერიუმები: კანდიდატები, რომლებსაც აქვთ მინიმუმ კოლეჯის ხარისხი და 2 ან მეტი წლის შესაბამისი სამუშაო გამოცდილება, შეუძლიათ გასაუბრებაზე.
// გასაუბრებაზე უფლება აქვთ კანდიდატებს, რომლებსაც აქვთ საშუალო სკოლის დიპლომი და 5 წელზე მეტი ხნის შესაბამისი სამუშაო გამოცდილება.
//  საუნივერსიტეტო დიპლომის მქონე კანდიდატებს ავტომატურად შეუძლიათ გასაუბრებაზე, სამუშაო გამოცდილების მიუხედავად.
//  მომხმარებლისთვის აჩვენეთ შეტყობინება, რომელშიც მითითებულია მათი უფლებამოსილების სტატუსი გასაუბრებაზე
// ?
// 8) For და While ციკლი



// პირველი დავალება --- 

// მომხმარებელს შემოატანინეთ რიცხვი და გამოიცანით შემოტანილი რიცხვი, იქამდე სცადეთ რიცხვის გამოტანა სანამ სწორს არ შეუყვანთ




// მეორე დავალება --- 

// ჩაწერეთ JavaScript ფუნქცია იმის დასადგენად, არის თუ არა მოცემული რიცხვი მარტივი რიცხვი.
//  სთხოვეთ მომხმარებელს შეიყვანოს ნომერი. დარწმუნდით, რომ მომხმარებელმა შეიყვანს 1-ზე მეტი დადებითი მთელი რიცხვი.
//   დაადგინეთ,
//   შეყვანილი რიცხვი არის თუ არა მარტივი რიცხვი. აჩვენეთ შეტყობინება, რომელიც მიუთითებს,
//  არის თუ არა ნომერი მარტივი.
let s;
while(s>1){

}