//1)

let a = Number(prompt('Give me a number'))
let b = Number(prompt('Give me a number 2.0'))
alert(`Number: ${b+a}`)
//2) 
let c = (prompt('Tell us your Name'))
let d = (prompt('Tell us your Surname'))
alert(`Welcome ${c+d}`)

//3)



//4)


//5)

 let number = prompt('რამდენი წლის ხარ მართის მოწმობას რო ითხოვ ჰა? ', );
 if (number < 13) {
    alert('ბავშვი ხარ ძმა რა მოწმობა')
 }
 else if (number < 19){
    alert('შენ ხარ მოზარდი შემიძლია მოგცე ')
 }
 else {
     alert('სრულწლოვანი ხარ, ძმა გეთქვა მერე მაშინვე მოგცმედი')
}
// 5) შექმენით ფუნქცია სახელად isTeenager,
//  რომელიც იღებს ორ პარამეტრს: ასაკი (რიცხვი) და hasPermission.
//   ფუნქცია უნდა დაბრუნდეს False, თუ ადამიანი არის მოზარდი (18 წლამდე) და არ აქვს ნებართვა აიღოს მართვის მოწმობა,
//    ან თუ ადამიანი არის 18 წლის და აქვს უფლება აიღოს მართვის მოწმობა ფუნქციამ დააბრუნოს true.  გამოიყენეთ "and" (&&) და "or" (||)

//6)

// შექმენით ფუნქცია სახელად isValidCoupon,
//  რომელიც იღებს ორ პარამეტრს: couponCode (სტრინგი) და totalAmount (რიცხვი).
//   ფუნქცია უნდა დაბრუნდეს true, თუ კუპონის კოდი არის "SALE" ან "BIGSALE" და ჯამური თანხა მეტია ან ტოლია 50-ზე,
//    ან თუ კუპონის კოდი არის "LILSALE" მთლიანი თანხის მიუხედავად. წინააღმდეგ შემთხვევაში,
//  ის უნდა დაბრუნდეს false. გამოიყენეთ "და" (&&) და "ან" (||)
