// let - არის ერთერთი ცვლადის შექმნის ერთერთი მეშვეობა (keyword) რა მნიშვნელობასაც მიუთითებთ ჩვენ ამ ცვლადს ყველაფრის შეცვლა შეგვიძლია მომავალში მაგალითად

// let name = ('gurami')
// name = 'saba'

// const - ესეც არის ცვლადის შექმნის ერთ-ერთი მეშვეობა (keyword),  რა მნიშვნელობასაც მიუთითებთ ჩვენ ამ ცვლადს ის დარჩება ბოლომდე და მის შემდგომ რედაქტირებას ვერ შევძლებთ


// 1 დავალება:

// შექმენით ცვლადი (გამოიყინეთ ორივე მეშვეობა(keyword) და მათი თვისებები )   ამ ცვლადებში შემოიტანეთ თქვენი ოჯახის წევრების 
// სახლი გვარები და წლოვანებები და აგრეთვე რამდენი წლის იქნება თითოეული მათგანი 20 წელიწადში 

let DadName = ('Mamuka')
let MomName = ('Diana')
let BrotherName = ('Saba')

let DadAge = (42)
let MomAge = (34)
let BrotherAge = (8)

console.log("Dad Age after 20 years be", DadAge + 20)
console.log("Mom Age after 20 years be", MomAge + 20)
console.log("Brother Age after 20 years be", BrotherAge + 20)
// 2დავალება: 

// ამოხსენით ეს ამოცანა: ტყეში არი 6ჩიტი თითო ჩიტს აქვს
//  2 ბუდე თითო ბუდეს აქვს 3კვერცი და 3 კვერცხიდან გამოიჩეკება 3 ბარტყი რამდენი ბარტყი გამოიჩეკება ჯამში
console.log("Anwser of Task:",6*2*3)