// სავარჯიშო 1:


//  დაწერეთ პირობითი დებულება, 
// რომელიც ამოწმებს არის თუ არა რიცხვი 10-ზე მეტი.
//  თუ ასეა, დაბეჭდეთ „რიცხვი მეტია 10-ზე“; წინააღმდეგ შემთხვევაში დაბეჭდეთ „რიცხვი არ არის 10-ზე მეტი“.
if (30 > 10) {
    console.log('რიცხვი მეტია 10-ზე')
}
else {
    console.log('რიცხვი არ არის 10-ზე მეტი')
}
// სავარჯიშო 2:


// დაწერეთ პირობითი განცხადება,
//  რომელიც ამოწმებს, არის თუ არა ადამიანის ასაკი 18-ზე მეტი ან ტოლი. თუ ასეა, დაბეჭდეთ „თქვენ გაქვთ ხმის მიცემის უფლება“;
// წინააღმდეგ შემთხვევაში,
//  ბეჭდვა "თქვენ არ გაქვთ ხმის მიცემის უფლება". 

// 1 ვარიანტი

// if (18 == 18) {
//     console.log('თქვენ გაქვთ ხმის მიცემის უფლება')
// }
// else  {
//    console.log('თქვენ არ გაქვთ ხმის მიცემის უფლება')
// }

// 2 ვარიანტი

// let number = prompt('რამდენი წლის ხარ ', );
// if (number < 18) {
//     alert('თქვენ არ გაქვთ ხმის მიცემის უფლება')
// }
// else {
//     alert('თქვენ გაქვთ ხმის მიცემის უფლება')
// }



// სავარჯიშო 3:


// დაწერეთ პირობითი დებულება, 
// რომელიც ამოწმებს რიცხვი დადებითია, უარყოფითი ან ნული. 
// დაბეჭდეთ შესაბამისი შეტყობინება თითოეული შემთხვევისთვის. 

let n = 2;
if (n > 0) {
    console.log('დადებითია')
}
else if (n < 0) {
    console.log('უარყოფითი')
}
else {
    console.log('ნულია')
}

// სავარჯიშო 4:


//  დაწერეთ პირობითი განცხადება,
//   რომელიც ამოწმებს, არის თუ არა ადამიანის ასაკი 13 წელზე ნაკლები. თუ ასეა,
//    დაბეჭდეთ „ბავშვი ხარ“; თუ ის 13-დან 19-მდეა,
// ბეჭდვა "შენ ხარ მოზარდი"; წინააღმდეგ შემთხვევაში დაბეჭდეთ „სრულწლოვანი ხარ“

//  let number = prompt('რამდენი წლის ხარ ', );
//  if (number < 13) {
//     alert('ბავშვი ხარ')
//  }
//  else if (number < 19){
//     alert('შენ ხარ მოზარდი')
//  }
//  else {
//      alert('სრულწლოვანი ხარ')
// }



// სავარჯიშო 5:
 

// მომხმარებელს შემოატანინეთ ქულა,
//  თუ რიცხვი ტოლია 100, მაშინ გამოიტანეთ,
//   რომ თქვენ დაგიფინანსდათ სწავლა სრულია, თუ ქულა მეტია 70 ზე,
//    მაშინ გამოიტანეთ, თქვენ დაგიფინანსდათ სწავლა 3000 ლარით, თუ შემოტანილი ქულა მეტია 40 ზე,
//     მაშინ გამმოიტანეთ, თქვენ დაგიფინანსდათ სწავლა 1000 ლარით, ხოლო თუ შემოტანილი ქულა ნაკლებია 20 ზე,
// მაშინ დაწერეთ თქვენ არ დაფინანსდათ სწავლა.

let point = prompt('შემოიტანეთ ქულა ', );
if (point == 100) {
   alert('თქვენ დაგიფინანსდათ სწავლა სრულია')
}
else if (point > 70){
   alert('თქვენ დაგიფინანსდათ სწავლა 3000 ლარით')
}
else if (point > 40){
    alert('თქვენ დაგიფინანსდათ სწავლა 1000 ლარით')
}
else if (point < 20){
        alert('თქვენ არ დაფინანსდათ სწავლა')
}
